test/dummy/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_event
      @event = Event.find(params[:id])